Autodesk.Revit.DB.Architecture.BreakCornerCondition
Condition on which the corner post is inserted.
Since:
2019

Autodesk.Revit.DB.Architecture.BreakCornerCondition.Never
Corner posts are not inserted in railings.

Autodesk.Revit.DB.Architecture.BreakCornerCondition.AnglesGreaterThan
Corner posts are inserted only when the angle between neighboring path segments is greater than the defined.

Autodesk.Revit.DB.Architecture.BreakCornerCondition.EachSegmentEnd
Corner posts are inserted at each segment end.